[
    "A large oak tree that is swarming with beautiful blue butterflies in the morning, and blue fireflies at night.",
    "A magical floating {bush/flower/plant/rose}. It hovers around in circles.",
    "A hollow tree stump with a friendly faerie dragon.",
    "Erosion has carved what appears to be a face into the side of a cliff.",
    "A giant skeleton sticking out of the ground. Looks like a triceratops, but larger.",
    "A giant flower with lots of bees surrounding it. Thousands of flowers similar to the giant one grow around it at a wide range of heights. Different kinds of fey live around it too.",
    "An overgrown, moss-covered, patinaed statue that looks just like elderly versions of the party.",
    "A small pond in the center of a clearing. The pond is faintly luminescent and flowers grow around its edge.",
    "A large smooth stone with runes in an ancient language adorning its surface.",
    "A large tree that is over 30 feet in diameter. This hulking monstrosity of nature has been cared for by locals and some revere it as a god.",
    "A frozen lake with a polished ice surface. If you look closely enough, you can see dead floating beneath the surface.",
    "A rock formation that looks eerily like a grinning goblin if viewed from the proper angle.",
    "A mountain range that when viewed from above looks like a gigantic quadruped monster.",
    "The ribcage of a giant whale that fell out of the sky a long time ago, surrounded by a field of petunias. Local legends differ in how it got there, but the most accepted answer is that it was an unexpected side effect of a wizards reckless attempt to mess with the nature of probability.",
    "A rocky, windy precipice rises above the surroundings, with vultures perched on every available foothold. Locals say the place is terribly cursed, but in reality the vultures only congregate there because the wind allows them to smell corpses from a great distance.",
    "A rotting, moss covered bookshelf in a clearing. Its decrepit shelves are filled with molding tomes in various states of decay. What is still legible in the books is a variety of languages and dialects, some unknown.",
    "A massive mushroom with a wide, flat top. Only the top is visible, and the rest is below ground. It will slowly rise from the the ground when it thinks no one is watching. If something looks at it while it is extended, it will quickly slam back into the ground.",
    "An old and gnarled tree has grown over and half-swallowed what appears to be the remains of a cart – the wood has rotted away, but the metal axel is still visible.",
    "A tree has fallen over a creek, its trunk forming a narrow bridge. It would be easy for a small-sized creature to walk across, but medium-sized creatures might have difficulty.",
    "A cluster of bright pink and yellow mushrooms have grown over and completely blanketed a rotted tree trunk.",
    "A series of miniature arches that is nearly always in the shadow of a larger arch.",
    "An extremely deep and narrow slot canyon. It’s easy to jump over, but if you fell in it would mean certain death.",
    "An enormous boulder balanced precariously on a thin, natural pillar.",
    "A wide, flat field completely covered in small holes… Something is living underground here.",
    "Enormous bones are scattered densely in this area. It’s a graveyard where large beasts come to die.",
    "A set of standing stones with intricate carvings cut into them. When the wind blows a certain way, the stones make a low humming sound that can be heard from miles away. The sound fills anyone that can here it with dread and despair.",
    "A small dark cave with with an extremely narrow crack in the floor, with steam billowing out. Due to the nature of the steam and the shape of the cave, it creates a low whistling sound at all times of the day.",
    "A magical Island that is invisible to those who don’t or can’t use magic; because of this may ship captains have crushed on its beach with no survivors due to the island’s security system. From the outside the island appears to a cluster of destroyed ships that have created a ring around the island, but when most captains see this mysterious landmark they write it off as ships running aground on a reef.",
    "The ruins of a Tower once connected to a series of watch stations that surround this area or did in the ancient world. There are several of these towers, each with their own secrets.",
    "A pond of water that rotates one direction in the morning and the other direction in the evening.",
    "Cliff Face that appears to have a large portion removed by a giant bite.",
    "A tall rock formation with two boulders at the bottom… Totally not phallic… (It is).",
    "A small statue of a hooded sitting hunched figure that always points slightly northwest.",
    "A large stone monolith towering upon a hillside. Along the back, a single rune written in charcoal and in the language of giants, the symbol for “help”.",
    "A dried up river or stream, with the remains of a long forgotten exodus. Bones stick up through the mud at strange angles.",
    "A small chasm cutting across an otherwise open field.",
    "Two tall pines holding up the skeletal remains of a behemoth.",
    "A massive multi-faceted field of quartz.",
    "A roughly circular depression overgrown with strangely warped vegetation. The very middle is raised and bare rock looking almost like cracked dark glass.",
    "Two trees, an ash and an elm which have grown up so close that they spiral around each other as they grew trunks and branches pressed together and entwined.",
    "Morla’s Daughter: In the middle of a swamp is a lone mountain with a small town at the top. There is something weird about the tortle settlement that leads visitors to think they are hiding something…even the mountain is shaped like a turtle shell.",
    "A sudden 12ft escarpment running roughly north-south for as far as the eye can see. Almost as if the all the land to the east as far as the sea had suddenly dropped 4 yards overnight.",
    "A weathered treestump about the height of a man. Dozens of age-tarnished coins have been hammered into one side of the stump.",
    "A large black obelisk stationed in the middle of a small island that is within what is now a lake. A river eroded the area and over the course of time the river carved out a small lake around the obelisk.",
    "A small cave at the start of river or brook. Inside the cave is small oasis, a waterfall, pool of crisp clear water, and flowering vines crawling up the walls leading to a an opening that lets in sunlight.",
    "An old tree with a fox shaped canopy when viewed from the South East.",
    "A small clearing between some rocks, with three sitting petrified trolls, with horrified looks in their faces.",
    "Two extremely close peaks with a river flowing between them. Looks like a mountain that was cut in half by the water.",
    "A big colorful crystal coming out of the ground, that separates the light that comes through it, creating miniature rainbows.",
    "A tiny volcano, that spews small embers, burning the vegetation directly next to it.",
    "Huge bones are in the area, sticking out from ground. An elephant could fit in the middle of them. They belonged to the abdomen of a really large creature.",
    "A giant’s skeleton on the side of a cliff. A large sword still stuck through it’s chest.",
    "A flooded pit quarry; standing neck-deep in the murky green water is the 75′ statue of a human king, his features fixed in a contemptuous snarl. Birds nest in his nostrils.",
    "Tar Pits rumored to have claimed the lives of various monstrosities.",
    "A winding path of high ground through a swamp, called the Witches Walk",
    "A tall rock surrounded by 20 evenly spaced smaller rocks. The smaller rocks have ancient number tunes on them, this structure is clearly some ancient sundial.",
    "Three treefolk have pinned down a stone golem. Roots have all but immobilized the once rampaging construct. It’s been 100 years since the battle and the treefolk are still sleepy from all the action.",
    "A soda geyser field that shoots out carbonated water out of the ground. Could be very profitable with anyone thinking of selling goodberry/fruit tonics the next town over.",
    "A group of islands with a mountain range in them. From the distance the peaks resemble a dragon’s claw emerging from the sea.",
    "What appears to be a puddle is actually a 30 foot deep pool of water with a 10 foot radius. Upon diving under, it appears to be full of tropical ocean life, and those submerged can hear what sounds like waves crashing on the surface.",
    "An invisible mountain. The only way this mountain is visible is by a seemingly floating waterfall beginning at 50 feet in the sky. (it is coming from a cave in the mountain.)",
    "A twenty foot high mushroom, enclosed in a circle of smaller mushrooms of varying heights(up to 5 feet). A history check reveals this location to have been home to a giant toad who would rest on the largest mushroom. Occasionally a ghostly ribbit pierces the air.",
    "A snow-covered field that looks flat, but the powdery snow covers up areas that are much deeper than expected. Heavy creatures could fall chest-deep (or worse) at any time.",
    "A small tropical oasis that exists year-round in the middle of a frozen tundra.",
    "Something about the weather of this place makes it rain perpetually.",
    "A volcano that is constantly spewing forth smoke. It’s never erupted, however.",
    "A swamp that experiences daily earth-tremors. When these happen, the water drains briefly and then refills over the next day.",
    "A clear, cold mountain spring that releases the same liquid as a healing potion. When the liquid has been out of the spring for more than an hour, it becomes normal water.",
]